nxp-mcuxpresso/mcux-sdk/components/power_manager/devices/MIMXRT1175/fsl_pm_device.c
#if defined(__CC_ARM) || defined(__ARMCC_VERSION)
extern uint32_t __Vectors[];
#define PM_RT1170_VECTOR_TABLE ((uint32_t)__Vectors)
#elif defined(__MCUXPRESSO)
extern uint32_t __Vectors[];
#define PM_RT1170_VECTOR_TABLE ((uint32_t)__Vectors)
#elif defined(__ICCARM__)
extern uint32_t __VECTOR_TABLE[];
#define PM_RT1170_VECTOR_TABLE ((uint32_t)__VECTOR_TABLE)
#elif defined(__GNUC__)
extern uint32_t __VECTOR_TABLE[];
#define PM_RT1170_VECTOR_TABLE ((uint32_t)__VECTOR_TABLE)
#endif

#elif __CORTEX_M == 4

#define CURRENT_GPC_INSTANCE   GPC_CPU_MODE_CTRL_1
#define CURRENT_STBY_CORE_NAME kGPC_CM7Core

/* clang-format off */
    #define PM_RT1170_CM4_COMPATIBLE_SETPOINT_MAP                           \
    {{NA , SP1, SP2, SP3, SP0, SP4, SP5, SP6, SP7, SP8, SP9, SP10, SP11, SP12, SP13, SP14, SP15}, \
    {SP1 ,   1,   0,   0,   0,   0,   0,   0,   0,   0,   0,    0,    0,    0,    0,    0,    0}, \
    {SP2 ,   1,   1,   0,   0,   0,   0,   0,   0,   0,   0,    0,    0,    0,    0,    0,    0}, \
    {SP3 ,   1,   1,   1,   1,   0,   0,   0,   0,   0,   0,    0,    1,    0,    0,    0,    0}, \
    {SP0 ,   1,   1,   0,   1,   0,   0,   0,   0,   0,   0,    0,    0,    0,    0,    0,    0}, \
    {SP4 ,   1,   1,   1,   1,   1,   0,   0,   0,   0,   0,    0,    1,    0,    0,    0,    0}, \
    {SP5 ,   1,   1,   1,   1,   1,   1,   0,   0,   0,   0,    0,    1,    0,    0,    0,    0}, \
    {SP6 ,   1,   1,   1,   1,   1,   1,   1,   0,   0,   0,    0,    1,    0,    0,    0,    0}, \
    {SP7 ,   1,   1,   1,   1,   1,   1,   1,   1,   0,   0,    0,    1,    0,    0,    0,    0}, \
    {SP8 ,   1,   1,   1,   1,   1,   1,   1,   1,   1,   0,    0,    1,    0,    0,    0,    0}, \
    {SP9 ,   1,   1,   1,   1,   1,   1,   1,   1,   1,   1,    0,    1,    0,    0,    0,    0}, \
    {SP10,   1,   1,   1,   1,   1,   1,   1,   1,   1,   1,    1,    1,    1,    0,    0,    0}, \
    {SP11,   1,   1,   0,   1,   0,   0,   0,   0,   0,   0,    0,    1,    0,    0,    0,    0}, \
    {SP12,   1,   1,   1,   1,   1,   1,   1,   1,   1,   1,    0,    1,    1,    0,    0,    0}, \
    {SP13,   1,   1,   1,   1,   1,   1,   1,   1,   1,   1,    1,    1,    1,    1,    0,    0}, \
    {SP14,   1,   1,   1,   1,   1,   1,   1,   1,   1,   1,    1,    1,    1,    1,    1,    0}, \
    {SP15,   1,   1,   1,   1,   1,   1,   1,   1,   1,   1,    1,    1,    1,    1,    1,    1}}
/* clang-format on */
#endif /* __CORTEX_M */

/*******************************************************************************
 * Prototypes
 ******************************************************************************/
#if __CORTEX_M == 7
static inline void RT1170_SetClockSourcesControlBySetpoint(void);
static inline void RT1170_SetCore0PlatformSetpointMap(GPC_CPU_MODE_CTRL_Type *base);
static inline void RT1170_SetPowerDomainsControlBySetpoint(void);
static inline void RT1170_SetPowerSupplyControlBySetpoint(void);
static inline void RT1170_SetSRCControlMode(void);
static inline void RT1170_SetSetpointTransitionFlow(void);
static inline void RT1170_SetStandbyTransitionFlow(void);
#endif /* __CORTEX_M == 7 */

#if __CORTEX_M == 4
static inline void RT1170_SetCore1PlatformSetpointMap(GPC_CPU_MODE_CTRL_Type *base);
#endif /* __CORTEX_M == 4 */

static inline uint8_t RT1170_FindOperateMode(uint32_t rescIndex, pm_resc_group_t *pSysRescGroup);
static inline void RT1170_SetSleepTransitionFlow(void);

static void RT1170_PreparePowerSetting(void);
static void RT1170_EnterPowerState(uint8_t stateIndex, pm_resc_mask_t *pSoftRescMask, pm_resc_group_t *pSysRescGroup);
#if (defined(FSL_PM_SUPPORT_WAKEUP_SOURCE_MANAGER) && FSL_PM_SUPPORT_WAKEUP_SOURCE_MANAGER)
static status_t RT1170_ManageWakeupSource(pm_wakeup_source_t *ws, bool enable);
static bool RT1170_IsWakeupSource(pm_wakeup_source_t *ws);
#endif /* (defined(FSL_PM_SUPPORT_WAKEUP_SOURCE_MANAGER) && FSL_PM_SUPPORT_WAKEUP_SOURCE_MANAGER) */

/*******************************************************************************
 * Variables
 ******************************************************************************/

#if __CORTEX_M == 7
const uint16_t g_clockSourceSpMapping[29U] = {
    0xFFFFU, /*!< Clock Source OSCPLL0: 16MHz RC OSC output, turn on in all setpoints. */
    0x0000U, /*!< Clock Source OSCPLL1: 48MHz RC OSC output, turn off in all setpoints. */
    0x0000U, /*!< Clock Source OSCPLL2: 48MHz divide by 2 clock output, turn off in all setpoints. */
    0x7FFFU, /*!< Clock Source OSCPLL3: 400MHz RC OSC output, turn off in setpoint 15. */
    0x7FU,   /*!< Clock Source OSCPLL4: Turn off from setpoint 7 to setpoint 15. */
    0x7FU,   /*!< Clock Source OSCPLL5: 24MHz main output clock, turn off from setpoint 7 to setpoint 15. */
    0x1FU,   /*!< Clock Source OSCPLL6: Turn off from setpoint 5 to setpoint 15. */
    0x1FU,   /*!< Clock Source OSCPLL7: ARM PLL main output clock,
                 turn off from setpoint 5 to setpoint 15. */
    0x7FU,   /*!< Clock Source OSCPLL8: Turn off from setpoint 7 to setpoint 15. */
    0x7FU,   /*!< Clock Source OSCPLL9: SYS PLL2 main output clock,
                 turn off from setpoint 7 to setpoint 15. */
    0x7FU,   /*!< Clock Source OSCPLL10: SYS PLL2 PFD0 clock, turn off from setpoint 7 to setpoint 15. */
    0x7FU,   /*!< Clock Source OSCPLL11: SYS PLL2 PFD1 clock, turn off from setpoint 7 to setpoint 15. */
    0x7FU,   /*!< Clock Source OSCPLL12: SYS PLL2 PFD2 clock, turn off from setpoint 7 to setpoint 15. */
    0x7FU,   /*!< Clock Source OSCPLL13: SYS PLL2 PFD3 clock, turn off from setpoint 7 to setpoint 15. */
    0x7FU,   /*!< Clock Source OSCPLL14: Turn off from setpoint 7 to setpoint 15. */
    0x7FU,   /*!< Clock Source OSCPLL15 : SYS PLL3 main output clock,
                 turn off from setpoint 7 to setpoint 15. */
    0x7FU,   /*!< Clock Source OSCPLL16: SYS PLL3 divided by 2 clock,
                 turn off from setpoint 7 to setpoint 15. */
    0x7FU,   /*!< Clock Source OSCPLL17: SYS PLL3 PFD0 clock, turn off from setpoint 7 to setpoint 15. */
    0x7FU,   /*!< Clock Source OSCPLL18: SYS PLL3 PFD1 clock, turn off from setpoint 7 to setpoint 15. */
    0x7FU,   /*!< Clock Source OSCPLL19: SYS PLL3 PFD2 clock, turn off from setpoint 7 to setpoint 15. */
    0x7FU,   /*!< Clock Source OSCPLL20: SYS PLL3 PFD3 clock, turn off from setpoint 7 to setpoint 15. */
    0xEU,    /*!< Clock Source OSCPLL21: Turn off in setpoint0 and from setpoint 4 to setpoint 15. */
    0xEU,    /*!< Clock Source OSCPLL22: System PLL1 main clock output, turn off in setpoint0 and from
             setpoint 4 to setpoint 15. */
    0xEU,    /*!< Clock Source OSCPLL23: System PLL1 divided by 2 clock , turn off in setpoint 0 and from
             setpoint 4 to setpoint 15. */
    0xEU,    /*!< Clock Source OSCPLL24: System PLL1 divided by 5 clock , turn off in setpoint 0 and from
             setpoint 4 to setpoint 15. */
    0x7FU,   /*!< Clock Source OSCPLL25: Turn off from setpoint 7 to setpoint 15. */
    0x7FU,   /*!< Clock Source OSCPLL26: Audio PLL main clock output,
                 turn off from setpoint 7 to setpoint 15. */
    0x7FU,   /*!< Clock Source OSCPLL27: Turn off from setpoint 7 to setpoint 15. */
    0x7FU,   /*!< Clock Source OSCPLL28 : Video PLL main clock output,
                 turn off from setpoint 7 to setpoint 15. */
};

static dcdc_buck_mode_1P8_target_vol_t g_dcdcBuckMode1P8Voltage[16U] = {
    kDCDC_1P8BuckTarget1P8V, // setpoint 0
    kDCDC_1P8BuckTarget1P8V, // setpoint 1
    kDCDC_1P8BuckTarget1P8V, // setpoint 2
    kDCDC_1P8BuckTarget1P8V, // setpoint 3
    kDCDC_1P8BuckTarget1P8V, // setpoint 4
    kDCDC_1P8BuckTarget1P8V, // setpoint 5
    kDCDC_1P8BuckTarget1P8V, // setpoint 6
    kDCDC_1P8BuckTarget1P8V, // setpoint 7
    kDCDC_1P8BuckTarget1P8V, // setpoint 8
    kDCDC_1P8BuckTarget1P8V, // setpoint 9
    kDCDC_1P8BuckTarget1P8V, // setpoint 10
    kDCDC_1P8BuckTarget1P8V, // setpoint 11
    kDCDC_1P8BuckTarget1P8V, // setpoint 12
    kDCDC_1P8BuckTarget1P8V, // setpoint 13
    kDCDC_1P8BuckTarget1P8V, // setpoint 14
    kDCDC_1P8BuckTarget1P8V, // setpoint 15
};

static dcdc_standby_mode_1P8_target_vol_t g_dcdcStandby1P8Voltage[16U] = {
    kDCDC_1P8StbyTarget1P8V, // setpoint 0
    kDCDC_1P8StbyTarget1P8V, // setpoint 1
    kDCDC_1P8StbyTarget1P8V, // setpoint 2
    kDCDC_1P8StbyTarget1P8V, // setpoint 3
    kDCDC_1P8StbyTarget1P8V, // setpoint 4
    kDCDC_1P8StbyTarget1P8V, // setpoint 5
    kDCDC_1P8StbyTarget1P8V, // setpoint 6
    kDCDC_1P8StbyTarget1P8V, // setpoint 7
    kDCDC_1P8StbyTarget1P8V, // setpoint 8
    kDCDC_1P8StbyTarget1P8V, // setpoint 9
    kDCDC_1P8StbyTarget1P8V, // setpoint 10
    kDCDC_1P8StbyTarget1P8V, // setpoint 11
    kDCDC_1P8StbyTarget1P8V, // setpoint 12
    kDCDC_1P8StbyTarget1P8V, // setpoint 13
    kDCDC_1P8StbyTarget1P8V, // setpoint 14
    kDCDC_1P8StbyTarget1P8V, // setpoint 15
};

static dcdc_buck_mode_1P0_target_vol_t g_dcdcBuckMode1P0Voltage[16U] = {
    kDCDC_1P0BuckTarget1P0V, /*!< setpoint 0. */
    kDCDC_1P0BuckTarget1P1V, /*!< setpoint 1. */
    kDCDC_1P0BuckTarget1P1V, /*!< setpoint 2. */
    kDCDC_1P0BuckTarget1P1V, /*!< setpoint 3. */
    kDCDC_1P0BuckTarget1P0V, /*!< setpoint 4. */
    kDCDC_1P0BuckTarget0P9V, /*!< setpoint 5. */
    kDCDC_1P0BuckTarget0P9V, /*!< setpoint 6. */
    kDCDC_1P0BuckTarget0P9V, /*!< setpoint 7. */
    kDCDC_1P0BuckTarget0P9V, /*!< setpoint 8. */
    kDCDC_1P0BuckTarget0P9V, /*!< setpoint 9. */
    kDCDC_1P0BuckTarget0P8V, /*!< setpoint 10. */
    kDCDC_1P0BuckTarget0P9V, /*!< setpoint 11. */
    kDCDC_1P0BuckTarget0P9V, /*!< setpoint 12. */
    kDCDC_1P0BuckTarget0P9V, /*!< setpoint 13. */
    kDCDC_1P0BuckTarget0P9V, /*!< setpoint 14. */
    kDCDC_1P0BuckTarget0P9V, /*!< setpoint 15. */
};

static dcdc_standby_mode_1P0_target_vol_t g_dcdcStandby1P0Voltage[16U] = {
    kDCDC_1P0StbyTarget1P0V, /*!< setpoint 0. */
    kDCDC_1P0StbyTarget1P1V, /*!< setpoint 1. */
    kDCDC_1P0StbyTarget1P1V, /*!< setpoint 2. */
    kDCDC_1P0StbyTarget1P1V, /*!< setpoint 3. */
    kDCDC_1P0StbyTarget1P0V, /*!< setpoint 4. */
    kDCDC_1P0StbyTarget0P9V, /*!< setpoint 5. */
    kDCDC_1P0StbyTarget0P9V, /*!< setpoint 6. */
    kDCDC_1P0StbyTarget0P9V, /*!< setpoint 7. */
    kDCDC_1P0StbyTarget0P9V, /*!< setpoint 8. */
    kDCDC_1P0StbyTarget0P9V, /*!< setpoint 9. */
    kDCDC_1P0StbyTarget0P8V, /*!< setpoint 10. */
    kDCDC_1P0StbyTarget0P9V, /*!< setpoint 11. */
    kDCDC_1P0StbyTarget0P9V, /*!< setpoint 12. */
    kDCDC_1P0StbyTarget0P9V, /*!< setpoint 13. */
    kDCDC_1P0StbyTarget0P9V, /*!< setpoint 14. */
    kDCDC_1P0StbyTarget0P9V, /*!< setpoint 15. */
};

static const dcdc_setpoint_config_t g_dcdcSpConfig = {
    .enableDCDCMap              = PM_RT1170_DCDC_ENABLE_SETPOINT_MAP,
    .enableDigLogicMap          = PM_RT1170_DCDC_DIG_ENABLE_SETPOINT_MAP,
    .lowpowerMap                = PM_RT1170_DCDC_LP_MODE_SETPOINT_MAP,
    .standbyMap                 = PM_RT1170_DCDC_STANDBY_SETPOINT_MAP,
    .standbyLowpowerMap         = PM_RT1170_DCDC_LP_MODE_STANDBY_SETPOINT_MAP,
    .buckVDD1P8TargetVoltage    = g_dcdcBuckMode1P8Voltage,
    .buckVDD1P0TargetVoltage    = g_dcdcBuckMode1P0Voltage,
    .standbyVDD1P8TargetVoltage = g_dcdcStandby1P8Voltage,
    .standbyVDD1P0TargetVoltage = g_dcdcStandby1P0Voltage,
};

static const pmu_lpsr_dig_target_output_voltage_t g_lpsrDigLdoTargetVoltage[16U] = {
    kPMU_LpsrDigTargetStableVoltage1P0V,   // setpoint 0, target voltage is 1.0V
    kPMU_LpsrDigTargetStableVoltage1P097V, // setpoint 1, target voltage is 1.097V
    kPMU_LpsrDigTargetStableVoltage1P0V,   // setpoint 2, target voltage is 1.0V
    kPMU_LpsrDigTargetStableVoltage0P903V, // setpoint 3, target voltage is 0.903V
    kPMU_LpsrDigTargetStableVoltage0P903V, // setpoint 4, target voltage is 0.903V
    kPMU_LpsrDigTargetStableVoltage0P903V, // setpoint 5, target voltage is 0.903V
    kPMU_LpsrDigTargetStableVoltage0P903V, // setpoint 6, target voltage is 0.903V
    kPMU_LpsrDigTargetStableVoltage0P903V, // setpoint 7, target voltage is 0.903V
    kPMU_LpsrDigTargetStableVoltage0P903V, // setpoint 8, target voltage is 0.903V
    kPMU_LpsrDigTargetStableVoltage0P903V, // setpoint 9, target voltage is 0.903V
    kPMU_LpsrDigTargetStableVoltage0P806V, // setpoint 10, target voltage is 0.806V
    kPMU_LpsrDigTargetStableVoltage1P0V,   // setpoint 11, target voltage is 1.0V
    kPMU_LpsrDigTargetStableVoltage0P903V, // setpoint 12, target voltage is 0.903V
    kPMU_LpsrDigTargetStableVoltage0P903V, // setpoint 13, target voltage is 0.903V
    kPMU_LpsrDigTargetStableVoltage0P806V, // setpoint 14, target voltage is 0.806V
    kPMU_LpsrDigTargetStableVoltage0P806V  // setpoint 15, target voltage is 0.806V
};
